Белгипрозем_2017/src/InformationRegisters/НапоминанияПользователя/НапоминанияПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НапоминанияПользователя</name>
  <resources>
    <name>СрокНапоминания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособУстановкиВремениНапоминания</name>
    <type>
      <types>EnumRef.СпособыУстановкиВремениНапоминания</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалВремениНапоминания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРеквизитаИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеИсточника</name>
    <comment>Представление источника</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ЗаписиРабочегоКалендаря</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Enums/ТипЗаписиКалендаря/ТипЗаписиКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипЗаписиКалендаря</name>
  <enumValues>
    <name>ПовторяющеесяСобытие</name>
  </enumValues>
  <enumValues>
    <name>Событие</name>
  </enumValues>
  <enumValues>
    <name>ЭлементПовторяющегосяСобытия</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Enums/СпособыУстановкиВремениНапоминания/СпособыУстановкиВремениНапоминания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыУстановкиВремениНапоминания</name>
  <enumValues>
    <name>ВУказанноеВремя</name>
  </enumValues>
  <enumValues>
    <name>ОтносительноТекущегоВремени</name>
  </enumValues>
  <enumValues>
    <name>ОтносительноВремениПредмета</name>
  </enumValues>
  <enumValues>
    <name>Периодически</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Enums/ЦветаРабочегоКалендаря/ЦветаРабочегоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦветаРабочегоКалендаря</name>
  <enumValues>
    <name>Нет</name>
  </enumValues>
  <enumValues>
    <name>Красный</name>
  </enumValues>
  <enumValues>
    <name>Синий</name>
  </enumValues>
  <enumValues>
    <name>Желтый</name>
  </enumValues>
  <enumValues>
    <name>Зеленый</name>
  </enumValues>
  <enumValues>
    <name>Оранжевый</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/InformationRegisters/НапоминанияПользователя/Forms/ФормаОповещенияДокументооборот/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Напоминание") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Напоминание = Параметры.Напоминание;
	ЗаписьКалендаря = Напоминание.Источник;
	УстановитьСрокПовторногоОповещения();
	ОбновитьДанныеЗаписиКалендаря();
	ОтложитьНапоминаниеПриЗакрытии = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбновитьКогда", 60);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ЗаписьКалендаря" И Параметр = ЗаписьКалендаря Тогда
		ОбновитьДанныеЗаписиКалендаря();
	ИначеЕсли ИмяСобытия = "ОткрытаФормаОповещения" Тогда
		ЗакрытьФорму();
	ИначеЕсли ИмяСобытия = "Запись_НапоминанияПользователя_Документооборот"
		И Источник = ЗаписьКалендаря Тогда
		ЗакрытьФорму();
	ИначеЕсли ИмяСобытия = "Удаление_НапоминанияПользователя_Документооборот"
		И Источник = ЗаписьКалендаря Тогда
		ЗакрытьФорму();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если ОтложитьНапоминаниеПриЗакрытии Тогда
		ОтложитьНапоминание();
		НапоминанияПользователяКлиент.СброситьТаймерПроверкиТекущихОповещений();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГиперссылкаПерейтиНажатие(Элемент)
	
	ПоказатьЗначение(, ПредметДляПерехода);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Прекратить(Команда)
	
	ПрекратитьНапоминание();
	ЗакрытьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	
	ОтложитьНапоминание();
	ЗакрытьФорму();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОтложитьНапоминание()
	
	ИнтервалВремени = НапоминанияПользователяКлиентСервер.ПолучитьИнтервалВремениИзСтроки(СрокПовторногоОповещения);
	
	Напоминание.СрокНапоминания = ТекущаяДата() + ИнтервалВремени;
	ПодключитьНапоминание(Напоминание);
	НапоминанияПользователяКлиент.ОбновитьЗаписьВКэшеОповещений(Напоминание);
	Оповестить("Запись_НапоминанияПользователя_Документооборот", Напоминание, Напоминание.Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрекратитьНапоминание()
	
	УдалитьЗаписьИзКэшаОповещений = ПрекратитьНапоминаниеСервер();
	
	Если УдалитьЗаписьИзКэшаОповещений Тогда
		НапоминанияПользователяКлиент.УдалитьЗаписьИзКэшаОповещений(Напоминание);
		Оповестить("Удаление_НапоминанияПользователя_Документооборот", , Напоминание.Источник);
		ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.НапоминанияПользователя"));
	Иначе
		НапоминанияПользователяКлиент.УдалитьЗаписьИзКэшаОповещений(Напоминание);
		НапоминанияПользователяКлиент.ОбновитьЗаписьВКэшеОповещений(НапоминаниеНовое);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПрекратитьНапоминаниеСервер()
	
	ПодключеноНовоеНапоминание = Ложь;
	Если ЗаписьКалендаряТипЗаписиКалендаря = Перечисления.ТипЗаписиКалендаря.ПовторяющеесяСобытие
		И Напоминание.СпособУстановкиВремениНапоминания = Перечисления.СпособыУстановкиВремениНапоминания.ОтносительноВремениПредмета 
		И Напоминание.ИмяРеквизитаИсточника = "ДатаНачала" Тогда
		
		ЗаписьКалендаряОбъект = ЗаписьКалендаря.ПолучитьОбъект();
		СледующаяДатаНачала = ЗаписьКалендаряОбъект.ПолучитьСледующуюДатуНачала(Напоминание.ВремяСобытия);
		Если ЗначениеЗаполнено(СледующаяДатаНачала) Тогда
			ПодключеноНовоеНапоминание = Истина;
			НапоминаниеНовое = НапоминанияПользователяСлужебный.ПодключитьНапоминаниеДоВремениПредмета(
				Строка(ЗаписьКалендаря.Ссылка), Напоминание.ИнтервалВремениНапоминания, ЗаписьКалендаря.Ссылка,
				"ДатаНачала", СледующаяДатаНачала);
		КонецЕсли;
		
	КонецЕсли;
	
	НапоминанияПользователяСлужебный.ОтключитьНапоминание(Напоминание);
	
	Возврат Не ПодключеноНовоеНапоминание;
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеЗаписиКалендаря()
	
	ЗаписьКалендаряТипЗаписиКалендаря = ЗаписьКалендаря.ТипЗаписиКалендаря;
	
	ЗаписьКалендаряОбъект = ЗаписьКалендаря.ПолучитьОбъект();
	РеквизитыЗаписиКалендаря = ЗаписьКалендаряОбъект.ПолучитьРеквизитыЗаписиКалендаря(Напоминание.ВремяСобытия);
	Если ЗначениеЗаполнено(РеквизитыЗаписиКалендаря) Тогда
		ЗаписьКалендаряОписание = РеквизитыЗаписиКалендаря.Описание;
		ЗаписьКалендаряДатаНачала = РеквизитыЗаписиКалендаря.ДатаНачала;
		ЗаписьКалендаряДатаОкончания = РеквизитыЗаписиКалендаря.ДатаОкончания;
	Иначе
		// Нет повторяющегося события на дату напоминания
		ЗаписьКалендаряОписание = ЗаписьКалендаря.Описание;
		ЗаписьКалендаряДатаНачала = ЗаписьКалендаря.ДатаНачала;
		ЗаписьКалендаряДатаОкончания = ЗаписьКалендаря.ДатаОкончания;
	КонецЕсли;
	
	Если НачалоДня(ЗаписьКалендаряДатаНачала) = НачалоДня(ТекущаяДатаСеанса()) Тогда
		Заголовок = НСтр("ru = 'Напоминание:'") + " "
			+ Формат(ЗаписьКалендаряДатаНачала, "ДФ=ЧЧ:мм") + ", " + ЗаписьКалендаря.ОписаниеКраткое;
	Иначе
		Заголовок = НСтр("ru = 'Напоминание:'") + " "
			+ Формат(ЗаписьКалендаряДатаНачала, "ДФ='ЧЧ:мм дд МММ'") + ", "  + ЗаписьКалендаря.ОписаниеКраткое;
	КонецЕсли;
	
	ЦветТабличногоДокумента = РаботаСРабочимКалендаремСервер.ПолучитьЦветСобытияКалендаря(ЗаписьКалендаря);
	Если ЦветТабличногоДокумента <> Перечисления.ЦветаРабочегоКалендаря.Нет Тогда
		Элементы.ЗаписьКалендаряОписание.ЦветФона =
			РаботаСРабочимКалендаремСервер.ПолучитьЦветТабличногоДокумента(ЦветТабличногоДокумента);
	КонецЕсли;
	
	ОтобразитьКогда(ЗаписьКалендаряДатаНачала, ЗаписьКалендаряДатаОкончания, Когда, ТекущаяДатаСеанса());
	Если ЗаписьКалендаряДатаНачала < ТекущаяДатаСеанса()
		И ЗаписьКалендаряДатаОкончания < ТекущаяДатаСеанса() Тогда
		Элементы.Когда.ЦветТекста = ЦветаСтиля.ПросроченныеДанныеЦвет;
	Иначе
		Элементы.Когда.ЦветТекста =Новый Цвет();
	КонецЕсли;
	
	Если ТипЗнч(ЗаписьКалендаря.Предмет) = Тип("СправочникСсылка.Мероприятия") Тогда
		МестоПроведения = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЗаписьКалендаря.Предмет, "МестоПроведения");
		Если ЗначениеЗаполнено(МестоПроведения) Тогда
			ЗаписьКалендаряОписание =
				НСтр("ru = 'Место проведения:'") + " " + МестоПроведения + Символы.ПС + ЗаписьКалендаряОписание;
		КонецЕсли;
	КонецЕсли;
	
	РаботаСРабочимКалендаремКлиентСервер.УстановитьНадписьИПредметПерехода(
		ЗаписьКалендаря, ЗаписьКалендаря.Предмет, Элементы.ГиперссылкаПерейти.Заголовок, ПредметДляПерехода);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКогда()
	
	ОтобразитьКогда(ЗаписьКалендаряДатаНачала, ЗаписьКалендаряДатаОкончания, Когда, ТекущаяДата());
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОтобразитьКогда(ДатаНачала, ДатаОкончания, Когда, ТекущееВремя)
	
	КоличествоСекундДо = ДатаНачала - ТекущееВремя;
	КоличествоЧасовДо  = Цел(КоличествоСекундДо / 3600);
	КоличествоМинутДо  = Цел((КоличествоСекундДо - КоличествоЧасовДо * 3600) / 60);
	КоличествоДнейДо = Цел(КоличествоСекундДо / 86400); // 86400 - число секунд в сутках
	
	КоличествоСекундПосле = ТекущееВремя - ДатаОкончания;
	КоличествоЧасовПосле  = Цел(КоличествоСекундПосле / 3600);
	КоличествоМинутПосле  = Цел((КоличествоСекундПосле - КоличествоЧасовПосле * 3600) / 60);
	КоличествоДнейПосле = Цел(КоличествоСекундПосле / 86400); // 86400 - число секунд в сутках
	
	ПредставлениеДней = НСтр("ru = 'день'")
		+ "," + НСтр("ru = 'дня'")
		+ "," + НСтр("ru = 'дней'");
	ПредставлениеЧасов = НСтр("ru = 'час'")
		+ "," + НСтр("ru = 'часа'")
		+ "," + НСтр("ru = 'часов'");
	ПредставлениеМинут = НСтр("ru = 'минута'")
		+ "," + НСтр("ru = 'минуты'")
		+ "," + НСтр("ru = 'минут'");
		
	Если КоличествоСекундДо > 0 Тогда
		
		Если КоличествоДнейДо > 0 Тогда
			
			Если КоличествоДнейДо = 1 Тогда
				ОсталосьПрописью = НСтр("ru = 'остался'");
			Иначе
				ОсталосьПрописью = НСтр("ru = 'осталось'");
			КонецЕсли;
			
			ДнейДоПрописью = СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(
				КоличествоДнейДо, 
				ПредставлениеДней);
			
			ПредставлениеСрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				" (%1 %2)", 
				ОсталосьПрописью,
				ДнейДоПрописью);
			
		ИначеЕсли КоличествоЧасовДо > 0 Тогда
			
			Если КоличествоЧасовДо = 1 Тогда
				ОсталосьПрописью = НСтр("ru = 'остался'");
			Иначе
				ОсталосьПрописью = НСтр("ru = 'осталось'");
			КонецЕсли;
			
			ЧасовДоПрописью = СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(
				КоличествоЧасовДо, 
				ПредставлениеЧасов);
			
			МинутДоПрописью = СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(
				КоличествоМинутДо, 
				ПредставлениеМинут);
			
			ПредставлениеСрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				" (%1 %2 %3)", 
				ОсталосьПрописью,
				ЧасовДоПрописью,
				МинутДоПрописью);
			
		ИначеЕсли КоличествоМинутДо > 0 Тогда
			
			Если КоличествоМинутДо = 1 Тогда
				ОсталосьПрописью = НСтр("ru = 'осталась'");
			Иначе
				ОсталосьПрописью = НСтр("ru = 'осталось'");
			КонецЕсли;
			
			МинутДоПрописью = СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(
				КоличествоМинутДо, 
				ПредставлениеМинут);
			
			ПредставлениеСрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				" (%1 %2)", 
				ОсталосьПрописью,
				МинутДоПрописью);
			
		Иначе
			
			ПредставлениеСрока = НСтр("ru = '(осталось меньше минуты)'");
			
		КонецЕсли;
		
	ИначеЕсли КоличествоСекундДо <= 0  И КоличествоСекундПосле <= 0 Тогда
		
		ПредставлениеСрока = НСтр("ru = '(сейчас)'");
		
	ИначеЕсли КоличествоСекундПосле > 0 Тогда
		
		Если КоличествоДнейПосле > 0 Тогда
			
			Если КоличествоДнейПосле = 1 Тогда
				ПрошлоПрописью = НСтр("ru = 'прошел'");
			Иначе
				ПрошлоПрописью = НСтр("ru = 'прошло'");
			КонецЕсли;
			
			ДнейПослеПрописью = СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(
				КоличествоДнейПосле, 
				ПредставлениеДней);
			
			ПредставлениеСрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				" (%1 %2)", 
				ПрошлоПрописью,
				ДнейПослеПрописью);
			
		ИначеЕсли КоличествоЧасовПосле > 0 Тогда
			
			Если КоличествоЧасовПосле = 1 Тогда
				ПрошлоПрописью = НСтр("ru = 'прошел'");
			Иначе
				ПрошлоПрописью = НСтр("ru = 'прошло'");
			КонецЕсли;
			
			ЧасовПослеПрописью = СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(
				КоличествоЧасовПосле, 
				ПредставлениеЧасов);
			
			МинутПослеПрописью = СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(
				КоличествоМинутПосле, 
				ПредставлениеМинут);
			
			ПредставлениеСрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				" (%1 %2 %3)", 
				ПрошлоПрописью,
				ЧасовПослеПрописью,
				МинутПослеПрописью);
			
		ИначеЕсли КоличествоМинутПосле > 0 Тогда
			
			Если КоличествоМинутПосле = 1 Тогда
				ПрошлоПрописью = НСтр("ru = 'прошла'");
			Иначе
				ПрошлоПрописью = НСтр("ru = 'прошло'");
			КонецЕсли;
			
			МинутПослеПрописью = СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(
				КоличествоМинутПосле, 
				ПредставлениеМинут);
			
			ПредставлениеСрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				" (%1 %2)", 
				ПрошлоПрописью,
				МинутПослеПрописью);
			
		Иначе
			
			ПредставлениеСрока = НСтр("ru = '(прошло меньше минуты)'");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НачалоДня(ДатаНачала) = НачалоДня(ТекущееВремя) Тогда
		Когда = Формат(ДатаНачала, "ДФ=ЧЧ:мм") + НСтр("ru = ', сегодня'") + ПредставлениеСрока;
	Иначе
		Когда = Формат(ДатаНачала, "ДФ='ЧЧ:мм, дд ММММ'") + ПредставлениеСрока;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСрокПовторногоОповещения()
	
	ВремяДоСобытияМинут = (Напоминание.ВремяСобытия - ТекущаяДатаСеанса())/60;
	
	Если ВремяДоСобытияМинут <= 15 И ВремяДоСобытияМинут > 10 Тогда
		СрокПовторногоОповещения = НСтр("ru = '10 минут'");
	ИначеЕсли ВремяДоСобытияМинут <= 10 И ВремяДоСобытияМинут > 5 Тогда
		СрокПовторногоОповещения = НСтр("ru = '5 минут'");
	Иначе
		СрокПовторногоОповещения = НСтр("ru = '15 минут'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодключитьНапоминание(ПараметрыНапоминания)
	
	НапоминанияПользователяСлужебный.ПодключитьНапоминание(ПараметрыНапоминания, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму()
	
	Если Открыта() Тогда
		ОтложитьНапоминаниеПриЗакрытии = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
